cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'macvim-dev/macvim'

brew 'aria2'
brew 'autoconf'
brew 'automake'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git', args: ['with-gettext','with-pcre','without-completions']
brew 'git-flow'
brew 'lua'
brew 'luajit'
brew 'macvim-dev/macvim/macvim', args: ['HEAD','with-lua','with-override-system-vim']
brew 'mpv', args: ['with-bundle']
brew 'mono'
brew 'node'
brew 'openssl'
brew 'proxychains-ng'
brew 'p7zip'
brew 'python'
brew 'python3'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'

cask 'dash'
cask 'google-chrome'
cask 'iterm2'
cask 'itsycal'
cask 'shiftit'
cask 'sourcetree'
cask 'squirrel'
cask 'slack'
cask 'tunnelblick'

#quick looks plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

#the bundles below needs a lisence
cask 'alfred'
cask 'bartender'
cask 'cleanmymac'
cask 'istat-menus'
