cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'macvim-dev/macvim'

brew 'aria2'
brew 'autoconf'
brew 'automake'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-compose'
brew 'fzf'
brew 'git'
brew 'git-flow'
brew 'imagemagick'
brew 'lua'
brew 'luajit'
brew 'macvim-dev/macvim/macvim', args: ['HEAD','with-lua','with-override-system-vim']
brew 'mpv'
brew 'mono'
brew 'node'
brew 'openssl'
brew 'proxychains-ng'
brew 'python'
brew 'python3'
brew 'sshuttle'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'

cask 'bittorrent'
cask 'bittorrent-sync'
cask 'dash'
cask 'diffmerge'
cask 'flux'
cask 'google-chrome'
cask 'go2shell'
cask 'istat-menus'
cask 'iterm2'
cask 'itsycal'
cask 'karabiner'
cask 'lantern'
cask 'omnidisksweeper'
cask 'shiftit'
cask 'sourcetree'
cask 'splashtop-personal'
cask 'squirrel'
cask 'slack'
cask 'tunnelblick'

#the bundles below needs a lisence
cask 'alfred'
cask 'bartender'
cask 'cleanmymac'
